testdata/IN_2023_02/eunterschriften/Basisrente/BIR_OhneSEPA_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getOffer xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vbl="urn:de:vb:bipro:taa:vbl:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      
      <tarif:Request>
        
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
        
        <tarif:Angebot>
          
          <gevo:Vermittler>
            
            <allg:PartnerID>10940406</allg:PartnerID>
            
            <allg:Vermittlerrolle>
              
              <allg:ArtID>01</allg:ArtID>
              
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
              
            </allg:Vermittlerrolle>
            
          </gevo:Vermittler>
          
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
            
            <partner:PartnerID>10940406</partner:PartnerID>
            
          </tarif:Partner>
          
          <tarif:Partner xsi:type="partner:CT_Person">
            
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
            
            <partner:Anrede>1</partner:Anrede>
            
            <partner:PartnerID>20929886</partner:PartnerID>
            
            <partner:Anschrift>
              
              <allg:Landname>Deutschland</allg:Landname>
              
              <partner:ArtID>1</partner:ArtID>
              
            </partner:Anschrift>
            
            <partner:Bankverbindung>
              
              <partner:Einzugsermaechtigung>false</partner:Einzugsermaechtigung>
              
            </partner:Bankverbindung>
            
            <partner:Geburtsdatum>1993-01-01</partner:Geburtsdatum>
            
            <partner:Geschlecht>1</partner:Geschlecht>
            
          </tarif:Partner>
          
          <tarif:Versicherungsnehmer>
            
            <partner:PartnerID>20929886</partner:PartnerID>
            
          </tarif:Versicherungsnehmer>
          
          <tarif:Verkaufsprodukt>
            
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
              
              <vb-leben:Transparente>false</vb-leben:Transparente>
              
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
              
            </basis:Erweiterung>
            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
              
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                
              </basis:Erweiterung>
              
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
              
              <pm:Beitrag>
                
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                
                <pm:Betrag>
                  
                  <allg:Betrag>300</allg:Betrag>
                  
                  <allg:Waehrung>EUR</allg:Waehrung>
                  
                </pm:Betrag>
                
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                
              </pm:Beitrag>
              
              <pm:Versicherungsdauer>
                
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                
              </pm:Versicherungsdauer>
              
              <pm:Kennung>BIR</pm:Kennung>
              
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                
                <basis:Erweiterung xsi:type="vb-leben:CT_RenteErweiterung">
                  
                  <vb-leben:TodesfallleistungImBezug>IndividuelleGarantiezeit</vb-leben:TodesfallleistungImBezug>
                  
                  <vb-leben:FondsrenteDaten>
                    
                    <vb-leben:ErhoehterTodesfallschutz>true</vb-leben:ErhoehterTodesfallschutz>
                    
                  </vb-leben:FondsrenteDaten>
                  
                  <vb-leben:BasisrenteDaten>
                    
                    <vb-leben:VorgabeartTodesfallsumme>AlsRente</vb-leben:VorgabeartTodesfallsumme>
                    
                  </vb-leben:BasisrenteDaten>
                  
                  <vb-leben:IndexDaten>
                    
                    <vb-leben:VorgabeartIndexbeteiligung>Chance</vb-leben:VorgabeartIndexbeteiligung>
                    
                    <vb-leben:Index>DAX</vb-leben:Index>
                    
                  </vb-leben:IndexDaten>
                  
                </basis:Erweiterung>
                
                <pm:Versicherungsdauer>
                  
                  <allg:AnzahlJahre>37</allg:AnzahlJahre>
                  
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                  
                </pm:Versicherungsdauer>
                
                <pm:Dynamik>
                  
                  <pm:Wert>0</pm:Wert>
                  
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                  
                </pm:Dynamik>
                
                <vs-pm:VersicherungssummeOderLeistung>
                  
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                  
                  <vs-pm:Wertschluessel xsi:type="vb-leben:STE_LeistungSchluesselErweitert">Klassisch</vs-pm:Wertschluessel>
                  
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                  
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                  
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                  
                </vs-pm:VersicherungssummeOderLeistung>
                
                <vs-pm:Bezugsrecht>
                  
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                  
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                  
                </vs-pm:Bezugsrecht>
                
                <pm-leben:Hochrechnungszins>3</pm-leben:Hochrechnungszins>
                
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                
                <pm-leben:UeberschussverwendungNachLeistung xsi:type="dt:STE_UeberschussverwendungBasis">14</pm-leben:UeberschussverwendungNachLeistung>
                
                <pm-leben:VersichertePerson>
                  
                  <partner:PartnerID>20929886</partner:PartnerID>
                  
                </pm-leben:VersichertePerson>
                
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                
                <pm-leben:Garantiezeit>
                  
                  <allg:AnzahlJahre>10</allg:AnzahlJahre>
                  
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                  
                </pm-leben:Garantiezeit>
                
              </pm:Elementarprodukt>
              
              <pm-leben:VorgabeBerechnung>
                
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                
              </pm-leben:VorgabeBerechnung>
              
            </pm:Produkt>
            
          </tarif:Verkaufsprodukt>
          
          <tarif:Beitragszahler>
            
            <partner:PartnerID>20929886</partner:PartnerID>
            
          </tarif:Beitragszahler>
          
        </tarif:Angebot>
        
      </tarif:Request>
      
    </tarif:getOffer>
  </soapenv:Body>
</soapenv:Envelope>
